Revit 2027 API
RebarShapeConstraintChordLength Class
 A constraint that can be applied to a RebarShapeDefinitionByArc and drives the straight distance between the arc endpoints.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraintChordLength
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RebarShapeConstraintChordLength : RebarShapeConstraint
Public Class RebarShapeConstraintChordLength
	Inherits RebarShapeConstraint
public ref class RebarShapeConstraintChordLength : public RebarShapeConstraint
type RebarShapeConstraintChordLength =
    class
        inherit RebarShapeConstraint
    end
The RebarShapeConstraintChordLength type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintChordLength |  Create a constraint to drive chord length.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RebarShapeConstraint)
Top
Methods
Name | Description
Dispose
(Inherited from RebarShapeConstraint)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetParamId |  Return the Id of the parameter associated with this constraint.
(Inherited from RebarShapeConstraint)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace